# GetExtent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointCloudAccess..::..GetExtent Method
IPointCloudAccess Interface See Also
---
Implement this method to returns an object that contains the bounding box of the entire point cloud, aligned to the point cloud coordinate system.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
Outline GetExtent()
```

Visual Basic
---
```text
Function GetExtent As Outline
```

Visual C++
---
```text
Outline^ GetExtent()
```

# ### Return Value
The bounding box of the point cloud.
# Remarks
The extents should reflect the maximum and minimum coordinates of the stored points, and not incorporate the offset.
# See Also
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace